Revit 2027 API
BuiltInFailures.FamilyFailures.SketchCannotBeAutomaticallyDimensioned Property
 Sketch can't be Automatically Dimensioned - this is a prerequisite for Labeled Dimensions to work properly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SketchCannotBeAutomaticallyDimensioned { get; }
Public Shared ReadOnly Property SketchCannotBeAutomaticallyDimensioned As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SketchCannotBeAutomaticallyDimensioned {
	FailureDefinitionId^ get ();
}
static member SketchCannotBeAutomaticallyDimensioned : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace